arduino/ArduinoCore-primo/boards.txt
######################################################
#ARDUINO PRIMO

primo.name=Arduino Primo
primo.vid.0=0x0d28
primo.pid.0=0x0204
primo.upload.tool=openocd
primo.upload.protocol=sam-ba
primo.upload.maximum_size=524288
primo.upload.use_1200bps_touch=false
primo.upload.speed=115200
primo.upload.wait_for_upload_port=false


primo.build.mcu=cortex-m4
primo.build.f_cpu=64000000L
primo.build.usb_product="Arduino Primo"
primo.build.board=nrF52832
primo.build.core=arduino
primo.build.extra_flags=-mthumb
primo.build.ldscript=linker_scripts/gcc/flash.ld
primo.build.openocdscript=openocd_scripts/arduino_primo.cfg
primo.build.variant=arduino_primo
primo.build.components=components
primo.build.vid=0x0d28
primo.build.pid=0x0204
primo.build.nRF52832_api_include= "-I{runtime.ide.path}/hardware/tools/CMSIS/CMSIS/Include" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/device" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/drivers_nrf/hal" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/drivers_nrf/config" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/drivers_nrf/delay" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/drivers_nrf/nrf_soc_nosd" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/drivers_nrf/uart" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/libraries/util" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/libraries/timer" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/libraries/trace" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/libraries/scheduler" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/libraries/uart" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/libraries/softuart" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/libraries/fifo" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/connection_handover/ac_rec" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/connection_handover/ep_oob_rec" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/connection_handover/hs_rec" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/connection_handover/le_oob_rec" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/connection_handover" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/generic/message" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/generic/record" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/launchapp" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/parser/message" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/parser/record" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/text" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/ndef/uri" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/t2t_lib" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/t2t_lib/hal_t2t" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/t2t_parser" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/nfc/t2t_lib" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/ble/common" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/softdevice/s132/headers" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/toolchain" "-I{runtime.ide.path}/hardware/arduino/nrf52/cores/arduino/components/toolchain/gcc"
